{
  "architectures": [
    "HoloForCausalLM"
  ],
  "bos_token_id": 1,
  "d_model": 768,
  "dropout": 0.0,
  "dtype": "float32",
  "eos_token_id": 2,
  "expansion_factor": 4,
  "hd_dim": 3072,
  "head_dim": 256,
  "holo_expansion_ratio": 4,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 8192,
  "model_type": "holo",
  "num_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "phase_scale": 3.0,
  "transformers_version": "4.57.3",
  "use_version": 2,
  "vocab_size": 50257
}
